WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_adc.c
  // regval = getreg32(STM32_DMA2_S0CR);
  // (--) CALLING DMA ISR NEED WORK-THE CODE NEEDED TO ASSIGN THE ISR ISN'T WRITTEN
  // //       1/2 full         full          transfer err  Direct Mode err
  // regval |= DMA_SCR_HTIE | DMA_SCR_TCIE | DMA_SCR_TEIE | DMA_SCR_DMEIE;
  // putreg32(regval, STM32_DMA2_S0CR);

  // Enable DMA Stream.
  regval = getreg32(STM32_DMA2_S0CR);
  regval |= DMA_SCR_EN;
  putreg32(regval, STM32_DMA2_S0CR);

#endif    // #if(0)
}

//================================================================
// Call all the sub-initialization functions
int meadow_adc_initialize(void)
{
  int ret;
  static bool firstTime = true;

#if defined CONFIG_ADC_TESTS
  syslog(1, "Entered meadow_adc_initialize()\n"); usleep(20 * 1000);
#endif

  if(firstTime)
  {
    firstTime = false;
    _dmaHandle = NULL;
    memset(_dmaDataBuf, 0, _adcBufSzBytes);

#if defined CONFIG_ADC_TESTS
    _noChangeCnt = 0;
#endif
  }
  else
  {
    syslog(LOG_WARNING, "Only initialize once\n");
    return -EALREADY;
  }

  // Setup the ADC Interrupt handler
  ret = irq_attach(STM32_IRQ_ADC, adc_conversion_interrupt_handler_isr,
            (void *)STM32_ADC1_BASE);
  if(ret < 0)
  {
    syslog(1, "Error calling irq_attach\n");
    return ret;
  }

  ret = adc_initialize();
  if(ret < 0)
  {
    syslog(1, "Error calling adc_initialize\n"); usleep(20 * 1000);
    return ret;
  }

  dma_initialize();

  adc_enable();

  // Enable ADC interrupt handler
  up_enable_irq(STM32_IRQ_ADC);
  
  _meadowAdcInit = true;
  // ADC + DMA won't start until adc_start() is called

#if defined CONFIG_ADC_TESTS
  syslog(1, "--> Exiting ADC config\n"); usleep(20 * 1000);
#endif

  return OK;
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/
// As few as 1 GPIO with 1 buffer element and as many as 16 GPIOs with a buffer
// limit not specified. However. the number of GPIOs must be an even multiple
// of the buffer.
int meadow_adc_configure(uint8_t gpioList[], uint32_t gpioCount,
          uint16_t *userDataBuf, uint32_t adcBufSzBytes)
{
#if defined CONFIG_ADC_TESTS
  syslog(1, "meadow_adc_configure() gpioCount:%lu, adcBufSzBytes:%lu, userDataBuf:%p\n",
            gpioCount, adcBufSzBytes, userDataBuf);
#endif

  // (--) SINCE API NOT TOTALLY NAILED DOWN, WON'T DO TESTING UNTIL IT'S FINALIZED
  // uint32_t gpioListOff;
  // uint32_t mapOff = 0;

  // uint32_t userBufElements;
  // if(userDataBuf == NULL)
  // {
  //   syslog(1, "%s@%d-Error:userDataBuf is NULL\n",
  //             __FILE__, __LINE__, adcBufSzBytes);
  //   return -EINVAL;   // Invalid argument
  // }
  
  // // Data elements are 2 bytes, therefore, size must be even number
  // if(adcBufSzBytes % 2)
  // {
  //   syslog(1, "%s@%d-Error:ADC values are always 16-bits and adcBufSzBytes is not even (%lu)\n",
  //             __FILE__, __LINE__, adcBufSzBytes);
  //   return -EINVAL;   // Invalid argument
  // }

  // // Each element is 2 bytes
  // userBufElements = adcBufSzBytes/2;

  // // Must have at least 1 entry per gpio
  // if(gpioCount < userBufElements)
  // {
  //   syslog(1, "%s@%d-Error:gpioCount:%lu < userBufElements:%lu\n",
  //             __FILE__, __LINE__, gpioCount, userBufElements);
  //   return -EINVAL;   // Invalid argument
  // }

  // // Verify GPIO list is valid
  // for(gpioListOff = 0; gpioListOff < gpioCount; gpioListOff++)
  // {
  //   // Look for matching port/pin in the list
  //   for(mapOff = 0; mapOff < MEADOW_ADC_GPIO_CHAN_MAP_LENGTH; mapOff++)
  //   {
  //     if(gpioList[gpioListOff] == _gpioAdcChanMap[mapOff])
  //       break;   // Found-it's connected to the ADC
  //   }

  //   // Did we go through the entire list and not find a match?
  //   if(mapOff == MEADOW_ADC_GPIO_CHAN_MAP_LENGTH)
  //   {
  //     syslog(LOG_INFO, "GPIO:0x%02x (P%c%d) not connected to ADC\n", gpioList[gpioListOff],
  //                 (gpioList[gpioListOff] >> 4) + 'A', gpioList[gpioListOff] & 0x0f);
  //     return -EINVAL;   // Invalid argument
  //   }
  // }

  // // Will the number of GPIOs exactly fill the provided buffer?
  // if(gpioCount % userBufElements != 0)
  // {
  //   // Don't allow empty buffer slots as it's likely the user made an unintended error.
  //   syslog(1, "%s@%d-Error:buffer size and the number of GPIOs not multiple.\n",
  //               __FILE__, __LINE__);
  //   return -EINVAL;   // Invalid argument
  // }

  // Populate global values
  _gpioList = gpioList;
  _gpioTransferCount = gpioCount;
  _userDataBuf = userDataBuf;
  _adcBufSzBytes = adcBufSzBytes;

  // Signaling semaphore
  sem_init(&_waitTillDoneSem, 0, 0);
  sem_setprotocol(&_waitTillDoneSem, SEM_PRIO_NONE);  

  // Do before configuration
  // DON'T FREE the buffer's address as it's part of the DMA configuration
  _dmaDataBuf = kmm_malloc(_adcBufSzBytes);
  if(_dmaDataBuf == NULL)
  {
    syslog(LOG_ERR, "%s@%d-Error:Buffer space not available\n",
                __FILE__, __LINE__);
    return -ENOMEM;   // Out of memory
  }

  meadow_adc_initialize();

  return OK;
}

//=========================================================
// Calling this function will initiate the ADC converstion process. It will
// run until the configured buffer is full. When the buffer is full (or error)
// the calling thread will return to the caller, signifing that the buffer
// is ready for inspection.
int meadow_adc_read_conversions(void)
{
  if(! _meadowAdcInit)
  {
    syslog(LOG_ERR, "%s@%d-Error:Meadow ADC not initialized.\n", __FILE__, __LINE__);
    return -EPERM;    // Operation not permitted
  }

  // Start the conversion
  adc_start();
  
  // Wait for conversion to finish for valid data
  meadow_adc_buffer_takesem(&_waitTillDoneSem);

#if defined CONFIG_ADC_TESTS
  // Note to execute the following display takes about 26 ms
  // Show data before copy
  static int callCount = 0;
  static int previousNoChg = 0;
  callCount++;
  if(previousNoChg != _noChangeCnt)
  {
    syslog(LOG_ERR, "%04d-Error Count:%05d\n", callCount, _noChangeCnt - 1);
  }
  previousNoChg = _noChangeCnt;
#endif

  // Conversion must have completed. Now copy collected data to user's
  // buffer and return
  memcpy(_userDataBuf, _dmaDataBuf, _adcBufSzBytes);
  return OK;
}
